{
  "activation_function": "gelu_new",
  "architectures": [
    "GPT2LMHeadModel"
  ],  
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_ctx": 5120,
  "n_embd": 5120,
  "n_head": 40, 
  "n_layer": 4,
  "n_positions": 2048,
  "resid_pdrop": 0.1,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 50
    }   
  },  
  "vocab_size": 50260,
  "gradient_checkpointing": true,
  "use_cache": false
}
